# -*- coding: utf-8 -*-

data = \
    {
        1:
            {
                'name': "羽箭",
                'quality': 0.1,
                'levelSpLimit':
                    {
                        1: 10,
                        2: 20,
                        3: 30,
                        4: 40,
                        5: 50,
                        6: 60,
                        7: 70,
                        8: 80,
                        9: 90
                    }
            },
        2:
            {
                'name': '碎石阵',
                'quality': 0.2,
                'levelSpLimit':
                    {
                        1: 10,
                        2: 20,
                        3: 30,
                        4: 40,
                        5: 50,
                        6: 60,
                        7: 70,
                        8: 80,
                        9: 90
                    }
            },
        3:
            {
                'name': '寒冰刺',
                'quality': 0.2,
                'levelSpLimit':
                    {
                        1: 10,
                        2: 20,
                        3: 30,
                        4: 40,
                        5: 50,
                        6: 60,
                        7: 70,
                        8: 80,
                        9: 90
                    }
            }
    }

allData = {'角色技能数据': data, }
