# -*- coding: utf-8 -*-

data = \
    {
        '炎石灵怪':
            {
                '模型名称': 'YanShiLingGuai',
                '生命值': 2,
                '攻击力': 2,
                '攻击频率': 2,   # 每十秒
                '移动速度': 8,
                '攻击距离':10,
                '活动范围':20,
                '技能移动速度': 5
            },
        '木精怪':
            {
                '模型名称': 'MuJingGuai',
                '生命值': 2,
                '攻击力': 2,
                '攻击频率': 2,   # 每十秒
                '移动速度': 6,
                '攻击距离':10,
                '活动范围':20,
                '技能移动速度': 5
            },
        '绿雾灵怪':
            {
                '模型名称': 'LvWuLingGuai',
                '生命值': 2,
                '攻击力': 2,
                '攻击频率': 2,   # 每十秒
                '移动速度': 8,
                '攻击距离':10,
                '活动范围':20,
                '技能移动速度': 5
            },
        '狼兽人怪':
            {
                '模型名称':'Wolf',
                '生命值': 100,
                '攻击力':50,
                '攻击频率':1,   #每十秒
                '移动速度': 4,
                '攻击距离':5,
                '活动范围':10,
                '技能移动速度': 3
            },
        '小狼兽人':
            {
                '模型名称':'LittleWolf',
                '生命值': 10,
                '攻击力':5,
                '攻击频率':2,   #每十秒
                '移动速度': 4,
                '攻击距离':3,
                '活动范围':10,
                '技能移动速度': 3
            }
    }
